# Set 1

1. Load the CSV file named **"carsales.csv"** into a Pandas DataFrame. Display the first 5 rows.

2. Calculate the mode of the **"Make"** column using Pandas.

3. Group the DataFrame by the **"Year"** column and calculate the median price for each year.

4. Create a **scatter plot** using Matplotlib to visualize the relationship between the **"Price"** and **"Mileage"** columns.

5. Filter the DataFrame to only include rows where the **"FuelType"** column is `'Petrol'`. Display the first 5 rows.

6. Calculate the total number of **missing values** in each column of the DataFrame using Pandas.

7. Create a **bar chart** using Matplotlib to show the count of each unique value in the **"BodyType"** column.

8. Calculate the **standard deviation** of the **"EngineSize"** column using NumPy.

9. Plot a **histogram** of the **"Price"** column using Pandas.

10. Filter the DataFrame to only include rows where the **"Year"** is greater than **2015**. Display the last 5 rows.

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('car_sales.csv')
df.head(5)

,Date,Salesperson,Customer Name,Car Make,Car Model,Car Year,Sale Price,Commission Rate,Commission Earned
0,2022-08-01,Monica Moore MD,Mary Butler,Nissan,Altima,2018,15983,0.070495,1126.73
1,2023-03-15,Roberto Rose,Richard Pierce,Nissan,F-150,2016,38474,0.134439,5172.40
2,2023-04-29,Ashley Ramos,Sandra Moore,Ford,Civic,2016,33340,0.114536,3818.63
3,2022-09-04,Patrick Harris,Johnny Scott,Ford,Altima,2013,41937,0.092191,3866.20
4,2022-06-16,Eric Lopez,Vanessa Jones,Honda,Silverado,2022,20256,0.113490,2298.85

In [4]:
df.describe()

          Car Year    Sale Price  Commission Rate  Commission Earned
count    99.000000     99.000000        99.000000          99.000000
mean   2016.161616  28622.989899         0.104150        2984.722323
std       3.616027  10867.683713         0.027091        1415.463346
min    2010.000000  10313.000000         0.051853         804.140000
25%    2013.000000  18382.000000         0.084937        1920.225000
50%    2016.000000  28160.000000         0.102855        2720.130000
75%    2019.000000  36864.500000         0.124378        3807.860000
max    2022.000000  48916.000000         0.149926        6678.720000

In [5]:
df['Car Make']

0        Nissan
1        Nissan
2          Ford
3          Ford
4         Honda
        ...
94         Ford
95       Nissan
96       Toyota
97         Ford
98    Chevrolet
Name: Car Make, Length: 99, dtype: object

In [7]:
df['Car Make'].mode()

0    Ford
Name: Car Make, dtype: object